#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
//判断是不是元音字母
//描述
//KiKi开始学习英文字母，BoBo老师告诉他，有五个字母A(a), E(e), I(i), O(o), U(u)称为元音，其他所有字母称为辅音，请帮他编写程序判断输入的字母是元音（Vowel）还是辅音（Consonant）。
//输入描述：
//多组输入，每行输入一个字母。
//输出描述：
//针对每组输入，输出为一行，如果输入字母是元音（包括大小写），输出“Vowel”，如果输入字母是非元音，输出“Consonant”。

//int main()
//{
//	int ch = 0;
//	while ((ch = getchar()) != EOF)
//	{
//		if ((ch == 'A') || (ch == 'a') || (ch == 'E') || (ch == 'e') || (ch == 'O') || (ch == 'o') || (ch == 'U') || (ch == 'u') || (ch == 'I') || (ch == 'i'))
//		{
//			printf("Vowel\n");
//		}
//		else
//		{
//			printf("Consonant\n");
//		}
//		getchar();
//	}
//	return 0;
//}
//再来一种方法
//int main()
//{
//	int ch = 0;
//
//	char vowel[] = "aeouiAEOUI";//先单独把元音字母设立起来
//	while ((ch == getchar()) != EOF)
//	{
//		//判断是否为元音字母
//		int i = 0;
//		int flag = 0;
//		for (i = 0; i < 10; i++)
//		{
//			if (ch == vowel[i])
//			{
//				flag = 1;//是元音字母
//				break;
//			}
//		}
//		if (flag == 1)
//		{
//			printf("Vowel\n");
//		}
//		else
//		{
//			printf("Consonant\n");
//
//		}
//		getchar();//清理\n
//	}
//	return 0;
//}





//BC105 矩阵相等判定
//
//描述
//KiKi得到了两个n行m列的矩阵，他想知道两个矩阵是否相等，请你回答他。(当两个矩阵对应数组元素都相等时两个矩阵相等)。
//
//输入描述：
//第一行包含两个整数n和m，表示两个矩阵包含n行m列，用空格分隔。
//
//从2到n + 1行，每行输入m个整数（范围 - 231~231 - 1），用空格分隔，共输入n*m个数，表示第一个矩阵中的元素。
//
//从n + 2行到2n + 1，每行输入m个整数（范围 - 231~231 - 1），用空格分隔，共输入n*m个数，表示第二个矩阵中的元素。
//1 < n, m < 10
//输出描述：
//一行，如果两个矩阵相等输出"Yes"并换行，否则输出"No"并换行。
//int main()
//{
//	int arr1[10][10] = { 0 };
//	int arr2[10][10] = { 0 };
//	int n = 0;
//	int m = 0;
//
//
//	scanf("%d %d", &n, &m);
//	int i = 0;
//	int j = 0;
//	//输入矩阵1
//	for (i = 0; i < n; i++)
//	{
//
//		for (j = 0; j < m; j++)
//		{
//			scanf("%d", &arr1[i][j]);
//		}
//	}
//
//	//输入矩阵2
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			scanf("%d", &arr2[i][j]);
//		}
//	}
//	int flag = 1;//矩阵相等
//判断矩阵元素
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			if (arr1[i][j] != arr2[i][j])
//			{
//				flag = 0;
//				break;
//			}
//		}
//	}
//	if (flag == 1)
//	{
//		printf("YES\n");
//	}
//	else
//	{
//		printf("NO\n");
//	}
//	return 0;
//}




//BC107 矩阵转置
//描述
//KiKi有一个矩阵，他想知道转置后的矩阵（将矩阵的行列互换得到的新矩阵称为转置矩阵），请编程帮他解答。
//
//输入描述：
//第一行包含两个整数n和m，表示一个矩阵包含n行m列，用空格分隔。(1≤n≤10, 1≤m≤10)
//
//从2到n + 1行，每行输入m个整数（范围 - 231~231 - 1），用空格分隔，共输入n*m个数，表示第一个矩阵中的元素。
//
//输出描述：
//输出m行n列，为矩阵转置后的结果。每个数后面有一个空格。
//int main()
//{
//	int n = 0;
//	int m = 0;
//	int arr[10][10] = { 0 };
//	scanf("%d %d", &n, &m);
//	int i = 0;
//	int j = 0;
//	//输入
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			scanf("%d", &arr[i][j]);
//		}
//	}
//	//转置输出
//	for (i = 0; i < m; i++)
//	{
//		for (j = 0; j < n; j++)
//		{
//			printf("%d ", arr[j][i]);
//		}
//		printf("\n");
//	}
//	return 0;
//}




